using Microsoft.VisualBasic;

public class  SravnenieDvuhChisel{
/*
Напишите консольную программу, в которую пользователь вводит с клавиатуры два числа. 
А программа сранивает два введенных числа и выводит на консоль 
результат сравнения (два числа равны, первое число больше второго или первое число меньше второго).

1.узнать и запомнить у пользователя первое число (a)
2.узнать и запомнить у пользователя второе число (b)
3.узнать ровно ли (а) число (b)
    3.1 если истина, 
        3.1.1 сказать (а) равно (b)
    3.2 если ложь
4.узнать больше ли число (а) числа (b)
    4.1 если истина,
        4.1.1 сказать (а) больше (b)
    4.2 если ложь
        4.2.1 сказать (b) больше (а)                   
*/
    public static void Start(){
        //1.узнать и запомнить у пользователя первое число (a)

        

        
    
    }

}

